In [1]:
import sys
sys.path.append("/home/srelins/docs/cy_fdm_builder/src")
from testing_helpers import *
from FDMTable import *
from FDMDataset import *

## TO DO:

* PRIORITY: TEST observation_period table!!
- in particular, work our what happens if you re-run .build() on a dataset

* start process with dataset - add guidance messages for dataset creation
* add check and warning for Null datetimes when adding start/end dates
i.e. dataset empty, build FDMTables -- or -- dataset contain XXXXX etc...
* run dataset build over whole dataset by default - add options to specify table_ids/FDMTable objects
* will need to add "verbose" functionality to FDMTables or the console print statements will be fucking epic
* add .drop() method to table

## Testing:

In [2]:
build_test_environment()

/home/srelins/anaconda3/envs/FDMBuilder/lib/python3.9/site-packages/pandas/core/frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

LOADING: table 1
LOADING: table 2
LOADING: table 3
LOADING: table 4
LOADING: table 5
LOADING: table 6

In [3]:
table_1 = FDMTable(
    source_table_full_id=f"{PROJECT}.CY_TESTS_SRC.src_table_1",
    dataset_id="CY_TESTS_FDM"
)
table_1.build()

	 ##### Initialising FDM Table - src_table_1 #####
________________________________________________________________________________

* Table src_table_1 copied to CY_TESTS_FDM!
	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_1 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* person_id found - syntax correct

2. Adding person_id column:

	* src_table_1 already contains person_id column

3. Adding event_start_date:

	No event_start_date column found and event_start_date_cols not specified.

	To complete the build process, an event start date is required. Specify the
	`event_start_date_cols` argument of the .build() method as either:

	* If one column contains the full event date:

	  run .build(event_start_date_cols="insert-column-name-here")
	  NOTE: The process assumes a default date format of year-month-day. If the
	  date column is formatted as day-month-year set the `event_start_date_format`
	  argument as "DMY" (i.e. .build(event_start_date_cols="column-name",
	  event_start_date_format="DMY")) or "MDY" if the format is month-day-year etc....

	* If the year month and day are in separate columns:

	  run .build(event_start_date_cols=["year-column-name", "month-column-name",
	  "day-column-name"])
	  NOTE: In the case that any of the year/month/day columns aren't available, you may
	  specify any of the year/month/day columns as constant value e.g:
	  .build(event_start_date_cols=["year-column-name", "Jan", "15"])

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_1 COULD NOT BE COMPLETED! #####

In [4]:
table_1.head()

            person_id start_date   end_date
0                  15 2009-06-19 2039-06-19
1  junk_person_id_505 1950-12-19 1980-12-19
2                   2 2008-04-03 2038-04-03
3                   6 1954-12-24 1984-12-24
4                   5 1950-01-18 1980-01-18
5                  13 1957-05-19 1987-05-19
6                  12 2017-03-23 2047-03-23
7  junk_person_id_374 2018-04-17 2048-04-17
8                   7 1969-11-08 1999-11-08
9                   4 1964-06-23 1994-06-23

In [5]:
table_1.build(event_start_date_cols="start_date", event_start_date_format="YMD",
              event_end_date_cols="end_date", event_end_date_format="YMD",)

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_1 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* person_id found - syntax correct

2. Adding person_id column:

	* src_table_1 already contains person_id column

3. Adding event_start_date:

	* event_start_date column added!

4. Adding event_end_date:

	* event_end_date column added!

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_1 COMPLETE! #####

In [6]:
table_2 = FDMTable(
    source_table_full_id=f"{PROJECT}.CY_TESTS_SRC.src_table_2",
    dataset_id="CY_TESTS_FDM"
)
table_2.head()

	 ##### Initialising FDM Table - src_table_2 #####
________________________________________________________________________________

* Table src_table_2 copied to CY_TESTS_FDM!

,digest,start_day,start_month,start_year,end_day,end_month,end_year
0,>N,16,1,2008,16,1.0,2038.0
1,=N,6,2,1972,6,2.0,2002.0
2,=M,4,2,2001,4,2.0,2031.0
3,>G,16,2,1953,16,2.0,1983.0
4,>J,14,2,1969,14,2.0,1999.0
5,junk_digest_990,17,3,2002,17,3.0,2032.0
6,>L,8,3,1950,8,3.0,1980.0
7,>F,25,3,1958,25,3.0,1988.0
8,=H,19,4,2004,19,4.0,2034.0
9,junk_digest_806,25,4,1971,25,4.0,2001.0

In [7]:
table_2.build(event_start_date_cols = ["start_year", "start_month", "start_day"],
              event_end_date_cols = ["end_year", "end_month", "end_day"])

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_2 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* digest found - syntax correct

2. Adding person_id column:

	* person_id column added!

3. Adding event_start_date:

	* event_start_date column added!

4. Adding event_end_date:

	* event_end_date column added!

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_2 COMPLETE! #####

In [8]:
table_3 = FDMTable(
    source_table_full_id = f"{PROJECT}.CY_TESTS_SRC.src_table_3",
    dataset_id="CY_TESTS_FDM"
)

	 ##### Initialising FDM Table - src_table_3 #####
________________________________________________________________________________

* Table src_table_3 copied to CY_TESTS_FDM!

In [9]:
table_3.head()

            EDRN month  year
0             IX     1  1973
1             HW     3  1964
2             IQ     3  1989
3             HX     4  1973
4             IU     4  1957
5             HV     4  1959
6             IR     4  1975
7  junk_EDRN_223     5  2001
8             HU     5  1994
9             IS     6  1993

In [10]:
table_3.build(
    event_start_date_cols=["year", "month", "15"]
)

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_3 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* EDRN found - syntax correct

2. Adding person_id column:

	* person_id column added!

3. Adding event_start_date:

	* event_start_date column added!

4. Adding event_end_date:

	No event_end_date column found and event_end_date_column not specified.
	event_end_date end date will be omitted. If you wish to add an event_end_date,
	re-run .build() specifying the `event_end_date` argument.

	Note: Table build process will complete, but the observation periods derived
	from a source table with only an event start date may not be accurate, and
	may result in erroneous observations going unidentified. Talk to the CYP data
	team if at all uncertain about ommiting the event end date.

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_3 COMPLETE! #####

In [11]:
table_4 = FDMTable(
    source_table_full_id=f"{PROJECT}.CY_TESTS_SRC.src_table_4",
    dataset_id="CY_TESTS_FDM"
)
table_4.head()

	 ##### Initialising FDM Table - src_table_4 #####
________________________________________________________________________________

* Table src_table_4 copied to CY_TESTS_FDM!

            person_id           digest start_date_string end_date_string
0                  34               ?J            6-5-05          6-5-35
1                  44               @J           3-12-17         3-12-47
2                  32               ?H          16-10-75        16-10-05
3                  36               ?L          27-11-84        27-11-14
4                  31               ?G          12-12-06        12-12-36
5                  45               @K           18-1-52         18-1-82
6  junk_person_id_463  junk_digest_463           14-8-08         14-8-38
7                  30               ?F           26-4-94         26-4-24
8                  47               @M          19-12-77        19-12-07
9                  37               ?M           17-3-18         17-3-48

In [12]:
table_4.build(
    event_start_date_cols="start_date_string",
    event_start_date_format="DMY",
    event_end_date_cols="end_date_string",
    event_end_date_format="DMY"
)

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_4 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* person_id found - syntax correct
	* digest found - syntax correct

2. Adding person_id column:

	* src_table_4 already contains person_id column

	NOTE: digest also found in src_table_4. If you
	wish to rebuild the person_id column from digest, drop the existing
	person_id column in src_table_4 and run .build() again

3. Adding event_start_date:

WARNING: 2 character years are ambiguous e.g. 75 will be parsed
as 1975 but 70 will be parsed as 2070. Consider converting year.
	* event_start_date column added!

4. Adding event_end_date:

WARNING: 2 character years are ambiguous e.g. 75 will be parsed
as 1975 but 70 will be parsed as 2070. Consider converting year.
	* event_end_date column added!

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_4 COMPLETE! #####

In [13]:
table_5 = FDMTable(
    source_table_full_id=f"{PROJECT}.CY_TESTS_SRC.src_table_5",
    dataset_id="CY_TESTS_FDM"
)
table_5.head()

	 ##### Initialising FDM Table - src_table_5 #####
________________________________________________________________________________

* Table src_table_5 copied to CY_TESTS_FDM!

            person_id           EDRN date_string
0                  45             JU    May-1952
1                  49             JY    May-2006
2                  55             KU   July-1975
3                  54             KT   June-2016
4                  47             JW  April-1953
5                  41             JQ  April-1966
6                  52             KR  March-1950
7  junk_person_id_410  junk_EDRN_410  March-1962
8                  50             KP  March-1965
9                  53             KS  March-2003

In [14]:
table_5.add_column('SPLIT(date_string, "-")[OFFSET(0)] AS month')
table_5.head()

            person_id           EDRN date_string  month
0                  45             JU    May-1952    May
1                  49             JY    May-2006    May
2                  55             KU   July-1975   July
3                  54             KT   June-2016   June
4                  47             JW  April-1953  April
5                  41             JQ  April-1966  April
6                  52             KR  March-1950  March
7  junk_person_id_410  junk_EDRN_410  March-1962  March
8                  50             KP  March-1965  March
9                  53             KS  March-2003  March

In [15]:
table_5.add_column('SPLIT(date_string, "-")[OFFSET(1)] AS year')
table_5.head()

            person_id           EDRN date_string  month  year
0                  45             JU    May-1952    May  1952
1                  49             JY    May-2006    May  2006
2                  55             KU   July-1975   July  1975
3                  54             KT   June-2016   June  2016
4                  47             JW  April-1953  April  1953
5                  41             JQ  April-1966  April  1966
6                  52             KR  March-1950  March  1950
7  junk_person_id_410  junk_EDRN_410  March-1962  March  1962
8                  50             KP  March-1965  March  1965
9                  53             KS  March-2003  March  2003

In [16]:
table_5.build(event_start_date_cols=["year", "month", "01"])

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_5 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* person_id found - syntax correct
	* EDRN found - syntax correct

2. Adding person_id column:

	* src_table_5 already contains person_id column

	NOTE: EDRN also found in src_table_5. If you
	wish to rebuild the person_id column from EDRN, drop the existing
	person_id column in src_table_5 and run .build() again

3. Adding event_start_date:

	* event_start_date column added!

4. Adding event_end_date:

	No event_end_date column found and event_end_date_column not specified.
	event_end_date end date will be omitted. If you wish to add an event_end_date,
	re-run .build() specifying the `event_end_date` argument.

	Note: Table build process will complete, but the observation periods derived
	from a source table with only an event start date may not be accurate, and
	may result in erroneous observations going unidentified. Talk to the CYP data
	team if at all uncertain about ommiting the event end date.

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_5 COMPLETE! #####

In [17]:
table_6 = FDMTable(
    source_table_full_id=f"{PROJECT}.CY_TESTS_SRC.src_table_6",
    dataset_id="CY_TESTS_FDM"
)
table_6.head()

	 ##### Initialising FDM Table - src_table_6 #####
________________________________________________________________________________

* Table src_table_6 copied to CY_TESTS_FDM!

            person_id           digest           EDRN  date_string
0                  68               BN             LX  10-Jul-2015
1                  61               BG             LQ  10-Mar-1954
2                  50               AF             KP  26-Dec-1993
3                  67               BM             LW  11-Feb-1959
4                  57               AM             KW  21-Mar-1955
5                  65               BK             LU  15-Dec-1980
6                  58               AN             KX   3-Oct-1983
7                  62               BH             LR  25-Feb-1997
8  junk_person_id_831  junk_digest_831  junk_EDRN_831  18-Aug-1956
9  junk_person_id_905  junk_digest_905  junk_EDRN_905  11-Jan-1951

In [18]:
table_6.build(
    event_start_date_cols="date_string",
    event_start_date_format="DMY",
)

	 ##### BUILDING FDM TABLE COMPONENTS FOR src_table_6 #####
________________________________________________________________________________

1. Checking for identifiers and correcting syntax:

	* person_id found - syntax correct
	* digest found - syntax correct
	* EDRN found - syntax correct

2. Adding person_id column:

	WARNING: both digest and EDRN found in src_table_6. Using digest by default.
	This may produce unexpected behaviour!
	* src_table_6 already contains person_id column

	NOTE: digest and EDRN also found in src_table_6. If you
	wish to rebuild the person_id column from digest or EDRN, drop the existing
	person_id column in src_table_6 and run .build() again

3. Adding event_start_date:

	* event_start_date column added!

4. Adding event_end_date:

	No event_end_date column found and event_end_date_column not specified.
	event_end_date end date will be omitted. If you wish to add an event_end_date,
	re-run .build() specifying the `event_end_date` argument.

	Note: Table build process will complete, but the observation periods derived
	from a source table with only an event start date may not be accurate, and
	may result in erroneous observations going unidentified. Talk to the CYP data
	team if at all uncertain about ommiting the event end date.

________________________________________________________________________________

	 ##### BUILD PROCESS FOR src_table_6 COMPLETE! #####

In [22]:
dataset = FDMDataset(
    dataset_id="CY_TESTS_FDM",
    fdm_tables=[table_1, table_2, table_3, table_4, table_5, table_6]
)

In [ ]:
dataset.build()

		 ##### BUILDING FDM DATASET CY_TESTS_FDM #####
________________________________________________________________________________

1. Checking source input tables:

	* src_table_1 - OK
	* src_table_2 - OK
	* src_table_3 - OK
	* src_table_4 - OK
	* src_table_5 - OK
	* src_table_6 - OK

2. Building person table:

	* Joining data from master person table
	* Person table built!

3. Building table of individuals with no person_id


                WITH missing_person_ids AS (

                SELECT "digest" AS identifier, digest AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_2`
                WHERE person_id IS NULL

UNION ALL

                SELECT "EDRN" AS identifier, EDRN AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_3`
                WHERE person_id IS NULL

UNION ALL

                SELECT "digest" AS identifier, digest AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_4`
                WHERE person_id IS NULL

UNION ALL

                SELECT "EDRN" AS identifier, EDRN AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_5`
                WHERE person_id IS NULL

UNION ALL

                SELECT "digest" AS identifier, digest AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_6`
                WHERE person_id IS NULL

UNION ALL

                SELECT "EDRN" AS identifier, EDRN AS value
                FROM `yhcr-prd-phm-bia-core.CY_TESTS_FDM.src_table_6`
                WHERE person_id IS NULL

                )
                SELECT *
                FROM missing_person_ids
                GROUP BY identifier, value

	* individuals_missing_person_id created with 10 entries

4. Building person_ids missing from master table

	* person_ids_missing_from_master created with 19 entries

5. Building initial observation_period table

	* observation_period table built

6. Removing entries outside observation period

	* entries outside observation period removed from src_table_1
	  and stored in src_table_1_outside_obs
	* entries outside observation period removed from src_table_2
	  and stored in src_table_2_outside_obs
	* entries outside observation period removed from src_table_3
	  and stored in src_table_3_outside_obs
	* entries outside observation period removed from src_table_4
	  and stored in src_table_4_outside_obs